<?
function str_translit($s) {
  
  $TRANSLIT_ARRAY=array(
  "а"=>"a",  "б"=>"b",  "в"=>"v",
  "г"=>"g",  "д"=>"d",  "е"=>"e",
  "ё"=>"e",  "ж"=>"j",  "з"=>"z",
  "и"=>"i",  "й"=>"i",  "к"=>"k",
  "л"=>"l",  "м"=>"m",  "н"=>"n",
  "о"=>"o",  "п"=>"p",  "р"=>"r",
  "с"=>"s",  "т"=>"t",  "у"=>"u",
  "ф"=>"f",  "х"=>"h",  "ц"=>"c",
  "ч"=>"ch",  "ш"=>"sh",  "щ"=>"sch",
  "ы"=>"i",  "э"=>"e",  "ю"=>"y",  
  "я"=>"ya",
  "А"=>"a",  "Б"=>"b",  "В"=>"v",
  "Г"=>"g",  "Д"=>"d",  "Е"=>"e",
  "Ё"=>"e",  "Ж"=>"j",  "З"=>"z",
  "И"=>"i",  "Й"=>"i",  "К"=>"k",
  "Л"=>"l",  "М"=>"m",  "Н"=>"n",
  "О"=>"o",  "П"=>"p",  "Р"=>"r",
  "С"=>"s",  "Т"=>"t",  "У"=>"u",
  "Ф"=>"f",  "Х"=>"h",  "Ц"=>"c",
  "Ч"=>"ch",  "Ш"=>"sh",  "Щ"=>"sch",
  "Ъ"=>"_",  "Ы"=>"i",  "Э"=>"e",  
  "Ю"=>"y",  "Я"=>"ya",
  );
  
  $TRANSLIT_CHARS=' abcdefjhigklmnopqrstuvwxyz0123456789_.!';
   
  $s1="";
  $s= strtolower($s);
  for($i=0;$i<strlen($s);$i++) {
    if(strpos($TRANSLIT_CHARS,$s[$i])) $s1.=$s[$i];
    elseif(isset($TRANSLIT_ARRAY[$s[$i]])) $s1.=$TRANSLIT_ARRAY[$s[$i]];
    else $s1.='_';
  }
  return $s1;
}

